### day06_04_Pandas
- 데이터를 검색(조회)하는 방법

### pandas에서 데이터를 조회하는 함수 4가지
#### 사용법은 동일 ex) loc[행,열]
#### 전체를 나타내는 방법 ex) loc[:,열]

- loc: 라벨값 기반의 2차원 인덱싱 ex)seoul..
- iloc: index 기반의 2차원 인덱싱 ex) 75000...
- at: 라벨값 기반의 2차원 인덱싱(한 개의 값만 조회하는 경우)
- iat: index 기반의 2차원 인덱싱(한 개의 값만 조회하는 경우)

In [1]:
# 샘플 데이터 만들기
import pandas as pd
import numpy as np
dic_02 = {'A':[1,4,7], 'B':[2,5,8], 'C':[3,6,9]}
df = pd.DataFrame(dic_02)
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [2]:
# loc[행, 열]
df.loc[:,:] #전체
df.loc[1,:] #1행의 전체 열
display(df.loc[1,:])

A    4
B    5
C    6
Name: 1, dtype: int64

In [3]:
a = df.loc[1,:]
display(a) # a의 B방의 데이터를 보여주세요.
display(a['B'])

A    4
B    5
C    6
Name: 1, dtype: int64

5

In [4]:
# B방의 데이터를 보여주세요.
display(df.loc[:,'B'])

# 2행의 A열의 데이터를 조회해주세요.
display(df.loc[2,'A'])

0    2
1    5
2    8
Name: B, dtype: int64

7

In [5]:
display(df)
# 1번 실습하기. df에서 A,B의 모든 행을 조회해주세요.
display(df.loc[:,['A','B']])

# 2번 실습하기. df에서 A,C의 모든 행을 조회해주세요.
display(df.loc[:,['A','C']])

# 3번 실습하기. df에서 A의 0, 2행의 합계을 조회해주세요. - 8 
# <내가>a = df.at[0,'A']
#       b = df.at[2,'A']
#       a+b
display(df.loc[[0,2],'A'].sum())

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

   A  B
0  1  2
1  4  5
2  7  8

   A  C
0  1  3
1  4  6
2  7  9

8

In [6]:
# 데이터프레임에서 연산을 수행하면 열을 기준으로 연산이 수행됩니다.
# - 열은 key와 비슷한 의미입니다.
df.loc[:,['A','C']].sum()

A    12
C    18
dtype: int64

In [7]:
# 주의할 점
# - loc는 라벨(label)을 기준으로만 조회가 가능한데..
#   행은 index가 작동합니다.
# df.loc[:,1] -> 에러... 열을 index로 조회하려고 했기 떄문

In [8]:
# iloc[행,열]: index기반으로 조회를 수행합니다.
df.iloc[:,1]
# 행은 주로 index(0,1,2...)로 되어있음....ㄹ

0    2
1    5
2    8
Name: B, dtype: int64

In [9]:
# at : 라벨값 기반으로 조회하지만 값을 1개만 조회할 때 사요
# - 값을 1개 조회할 때 loc보다 훨씬 빠릅니다.
# - timeit은 연산의 시간을 테스트해주는 특수 키워드입니다.
%timeit df.loc[1,'B']

9.33 µs ± 660 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [10]:
%timeit df.at[1,'B']

5.6 µs ± 245 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [11]:
# 조건을 통한 조회하기
# - A열의 값이 3보다 큰 행부터 전체 열을 조회해주세요.
df.loc[df.loc[:,'A'] > 3,:]
df.loc[df.A > 3,:]

   A  B  C
1  4  5  6
2  7  8  9

In [12]:
# df에서 A열만 조회해주세요.
df.loc[:,'A']
# df에서 A열에서 3보다 큰 것만 조회해주세요.
df.loc[:,'A'] > 3

df.A > 3

0    False
1     True
2     True
Name: A, dtype: bool

In [13]:
# 실습하기 
# -A열의 값이 3보다 큰 행부터 전체 열의 총 합계를 구해주세요.
#  df.loc[df.A>3,:].sum() -> Series
df.loc[df.A>3,:].sum().sum()

39

In [14]:
# 실습하기 1행의 데이터가 5이상인 열들만 조회해주세요.
df.loc[:,df.loc[1,:] >= 5]

   B  C
0  2  3
1  5  6
2  8  9

In [15]:
# 실습하기 . df의 2행의 모든 값에 * 2를 해서 조회해주세요.
df.loc[2,:] = df.loc[2,:] *2
df

    A   B   C
0   1   2   3
1   4   5   6
2  14  16  18

In [16]:
# df 3행에 [20, 21, 22] 값을 추가해보기.
df.loc[3,:] = [20, 21, 22]
df

      A     B     C
0   1.0   2.0   3.0
1   4.0   5.0   6.0
2  14.0  16.0  18.0
3  20.0  21.0  22.0

In [17]:
# df의 마지막 행에 값 추가하기
df.append([23, 24, 25])
# append도 조회한거라 위에꺼 df에 저장안된다.
# 결과가 이상하게 나오는 이유 : df의 type은 dataframe / [] 는 list라서

df2 = pd.DataFrame([[23,24,25]])
df.append(df2)
# 위에 이렇게 해보면 이상하게 나오는 이유 : df2의 column이 0,1 ,2 이기 때문에

      A     B     C     0     1     2
0   1.0   2.0   3.0   NaN   NaN   NaN
1   4.0   5.0   6.0   NaN   NaN   NaN
2  14.0  16.0  18.0   NaN   NaN   NaN
3  20.0  21.0  22.0   NaN   NaN   NaN
0   NaN   NaN   NaN  23.0  24.0  25.0

In [18]:
# column 명 변경하기
df2.columns = ['A','B','C']
df2
df.append(df2)
# 위에도 문제 발생 .. 23,24,25의 열이 0

      A     B     C
0   1.0   2.0   3.0
1   4.0   5.0   6.0
2  14.0  16.0  18.0
3  20.0  21.0  22.0
0  23.0  24.0  25.0

In [19]:
# df에 df2를 붙이면 df2의 0행으로 인하여 라벨이 붙는 형태가 됨.
# - reset_index()를 통하여 index를 초기화 할 수 있음.
df.append(df2).reset_index(drop=True)

      A     B     C
0   1.0   2.0   3.0
1   4.0   5.0   6.0
2  14.0  16.0  18.0
3  20.0  21.0  22.0
4  23.0  24.0  25.0

In [20]:
### 더 쉬운 방법..ㅇ
#  len()함수를 통해서 추가될 마지막 row 번호 만들기.
last_index = len(df)
last_index

# 만들어진 last_index를 통해서 df에 행 추가하기
df.loc[last_index,:] = [0,0,0]
df

      A     B     C
0   1.0   2.0   3.0
1   4.0   5.0   6.0
2  14.0  16.0  18.0
3  20.0  21.0  22.0
4   0.0   0.0   0.0

In [21]:
# df의 모양, 행의 갯수를 얻어오기
len(df)

5

In [22]:
# 열을 추가하기
# - 샘플데이터 초기화하기
df3 = pd.DataFrame(dic_02)
df3

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
# D라는 열에 10, 11, 12
df3.loc[:,'D'] = [10, 11, 12]
df3

   A  B  C   D
0  1  2  3  10
1  4  5  6  11
2  7  8  9  12

In [24]:
# 실습하기 D열의 값을 'one', 'two', 'one'으로 수정해주세요.
df3.loc[:,'D'] = ['one', 'two', 'one'] # 없었을 때 추가/ 있으면 수정./
df3

   A  B  C    D
0  1  2  3  one
1  4  5  6  two
2  7  8  9  one

In [25]:
# 해당 열에 포함 유무를 확인하기
# df3.C > 3 # '>'는 숫자만 가능.

# - df3의 D열에 one이라는 값이 포함된 행만 출력해주세요.
#   df3.D 포함된?? 'one'
df3.D.isin(['one'])

0     True
1    False
2     True
Name: D, dtype: bool

In [26]:
# - df3의 D열에 one이라는 값이 포함된 전체 행을 출력해주세요.
# - 행의 조건에 들어가야해!!  D가 two인 전체 행이 안나오니까..?
df3.loc[df3.D.isin(['one']),:]

   A  B  C    D
0  1  2  3  one
2  7  8  9  one

In [27]:
# - df3에서 D열에 one, two값이 포함된 전체 행을 출력해주세요.
df3.loc[df3.D.isin(['one','two']),:]

   A  B  C    D
0  1  2  3  one
1  4  5  6  two
2  7  8  9  one

### Grouping

In [28]:
# 데이터를 외부에서 불러오기
# pd.read_csv(불러올 데이터의 경로)
df2 = pd.read_csv('https://raw.githubusercontent.com/luxdolorosa/data_set/master/pandas/my_data_02.csv')

In [29]:
df2

     A      B         C         D
0  foo    one -0.272853  0.445702
1  bar    one -0.942053 -1.546124
2  foo    two  1.163523  1.230163
3  bar  three -0.428761  0.325022
4  foo    two  1.188806  2.189103
5  bar    two -1.320671 -1.510452
6  foo    one -1.729539  1.112231
7  foo  three  1.403014  0.256193

In [30]:
# df2의 합계를 구해주세요.
df2.sum()
# 머신러닝에서 문자는 연산에서 무시된다. count제외하고는 무시..

A        foobarfoobarfoobarfoofoo
B    oneonetwothreetwotwoonethree
C                       -0.938533
D                         2.50184
dtype: object

In [31]:
# df2의 A열을 그룹화하여 합계를 구하기
df2.groupby('A')
df2.groupby('A').sum()

            C         D
A
bar -2.691485 -2.731554
foo  1.752951  5.233392

In [32]:
# 질문
# df2.sum()
# sum(df2.C)
# 둘다 가능.

In [33]:
# df2의 B열을 그룹화하여 합계를 구하기
df2.groupby('B').sum()

              C         D
B
one   -2.944445  0.011809
three  0.974253  0.581215
two    1.031658  1.908814

In [34]:
# 실습하기. df2의 A열을 그룹화한 B열의 소그룹의 합계를 구해주세요.
df2.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.942053 -1.546124
    three -0.428761  0.325022
    two   -1.320671 -1.510452
foo one   -2.002392  1.557933
    three  1.403014  0.256193
    two    2.352329  3.419265